int sequence[][7] = {
  {1,1,1,1,1,1,0},  // 0
  {0,1,1,0,0,0,0},  // 1
  {1,1,0,1,1,0,1},  // 2
  {1,1,1,1,0,0,1},  // 3
  {0,1,1,0,0,1,1},  // 4
  {1,0,1,1,0,1,1},  // 5
  {1,0,1,1,1,1,1},  // 6
  {1,1,1,0,0,0,0},  // 7
  {1,1,1,1,1,1,1},  // 8
  {1,1,1,1,0,1,1},  // 9
};

void printNumber (int number) {
  for (int i = 0; i < 7; i++) {   //این تابع ورودی  را می گیرد و با ارایه sequence وضعیت هر ال ای دی زا بررسی  می کند.
    digitalWrite(1+i,sequence[number][i]);  
    }
}

void setup() {
  for (int i = 1; i < 8; i++)
    pinMode(i, OUTPUT); // در اینجا از پین یک تا هفت به عنوان خروجی تنظیم می شود
    }
}

void loop() {
  for (int i = 0; i < 10; i++) {  //   اجرا می شود این تابع بطور مداوم 
    printNumber(i);       //تاخیر هزارمیلی ثانبه ای 
    delay(1000);
    }
}